# coding=utf-8
# Даны три числа a, b, c. Определите, существует ли треугольник с такими сторонами. Если треугольник существует,
# выведите строку YES, иначе выведите строку NO
a = 120
b = 120
c = 220
if a + b >= c or b + c >= a or c + a >= b:
    print('yes')
else:
    print('no')
# Даны три числа a, b, c. Определите, существует ли треугольник с такими сторонами. Если треугольник существует,
# выведите строку YES, иначе выведите строку NO.
